src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТипНоменклатурыВключен(ПараметрТипНоменклатуры) Экспорт
	
	Если ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
		Возврат Ложь;
	ИначеЕсли ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ВидРабот")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
		Возврат Ложь;
	ИначеЕсли ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
		Возврат Ложь;
	ИначеЕсли ПараметрТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Операция")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьТехоперации") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
		СтандартнаяОбработка = Ложь;

		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Запас);
		СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьТехоперации") Тогда
			СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Операция);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
			СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.ВидРабот);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
			СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.ПодарочныйСертификат);
		КонецЕсли;
		
		ДоступнаПодсистемаРаботы = ВозможностиПриложения.КонстантаДоступнаВПриложении("ФункциональнаяОпцияИспользоватьПодсистемуРаботы");
		
		Если ДоступнаПодсистемаРаботы Тогда
			СписокВыбора.Добавить(Перечисления.ТипыНоменклатуры.Работа);
		КонецЕсли;
		
		ДанныеВыбора = СписокВыбора;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
